while True:
    num = input('Введи число: ')

    # Если возможное число отрицательное - избавляемся от минуса
    # Сохраняем результат в другую переменную, чтобы не изменять значение начальной переменной
    if num[0] == '-':
        n = num[1:]
    else:
        n = num

    # Подсчитываем количество точек в строке
    count_dot = n.count('.')

    if count_dot > 1:
        print('Данные введены некорректно. Нужно ввести число.')
    else:
        if n.count('.') == 1:
            index_dot = n.find('.')
            if index_dot != len(n) - 1:
                # Если в строке одна точка, и она не последний символ, делим эту строку на две: до точки и после
                n1 = n[:index_dot]
                n2 = n[index_dot + 1:]

                # Если обе строки являются целыми числами - преобразуем строку в число типа float
                if n1.isdigit() and n2.isdigit():
                    num = float(num)
                    break
                else:
                    print('Данные введены некорректно. Нужно ввести число.')

            else:
                # Если в строке одна точка, и она последний символ, - проверяем, является ли строка целым числом
                if n[:-1].isdigit():
                    num = int(num[0:-1])
                    break
                else:
                    print('Данные введены некорректно. Нужно ввести число.')
        else:
            # Если в строке нет точек - проверяем, является ли строка целым числом
            if n.isdigit():
                num = int(num)
                break
            else:
                print('Данные введены некорректно. Нужно ввести число.')
    print()

print(num)


