import random

print('Guess the words')
print()

word_list = ['город', 'машина', 'столик', 'книга', 'собака', 'туман', 'ручка', 'яблоко', 'береза', 'комната', 'река',
             'лодка', 'погода', 'ученик', 'письмо', 'школа', 'доска', 'окно', 'молоко', 'груша', 'тетрадь', 'семья',
             'солнце', 'цветок', 'картина', 'облако', 'дерево', 'игрушка', 'карман', 'телефон', 'пальто', 'площадь',
             'программа', 'компьютер', 'библиотека', 'работа', 'собрание', 'друзья', 'квартира', 'праздник', 'ночь',
             'утро', 'вечер', 'день', 'новость', 'концерт', 'песня', 'интернет', 'комплекс', 'работник', 'семинар',
             'планета', 'блог', 'портфель', 'образование', 'система', 'поездка', 'пейзаж', 'вкусный', 'жизнь',
             'практика', 'попытка', 'животное', 'глобус', 'проект', 'анализ', 'монитор', 'анекдот', 'технология',
             'кандидат', 'поток', 'вариант', 'реформы', 'изучение', 'вопрос', 'предмет', 'сотрудник', 'студент',
             'платформа', 'посещение', 'отдых', 'инструмент', 'сервис', 'ресторан', 'разговор', 'вечеринка', 'награда',
             'календарь', 'чемпион', 'подруга', 'статья', 'домашний', 'уровень', 'гаджет', 'выбор', 'успех', 'победа',
             'информация', 'кафе', 'страна', 'отель', 'сделка', 'планы', 'сайт', 'молодежь', 'время', 'подарок',
             'страшный', 'задание', 'снег', 'лето', 'человек', 'кино', 'карьер', 'менеджер', 'замечание',
             'обучение', 'секрет', 'познание', 'путевка', 'небо', 'услуга', 'поставщик', 'создание', 'клиент',
             'договор', 'поддержка', 'сеть', 'платеж', 'начало', 'директор', 'принцип', 'параметр', 'отзыв', 'тренировка',
             'интерфейс', 'компиляция', 'дисплей', 'гарантия', 'пароль', 'покрытие', 'обновление', 'активность',
             'контроль', 'персонаж', 'самостоятельность', 'обзор', 'учебник', 'партнер', 'идея', 'обсуждение',
             'недвижимость', 'функция', 'знание', 'безопасность', 'страх', 'файл', 'индекс', 'образ', 'проверка',
             'администрация', 'офис', 'действие', 'вход', 'психология', 'таблица', 'этап', 'партия', 'воздух', 'прибор',
             'событие', 'контракт', 'деятельность', 'доступ', 'правило', 'версия', 'объяснение', 'метод', 'передача',
             'переговоры', 'переработка', 'операция', 'цель', 'первичный', 'вещь', 'мероприятие', 'отчёт', 'интерактив',
             'кнопка', 'запуск', 'решение', 'основа', 'сообщение', 'прогноз', 'моторика', 'протокол', 'зрелище',
             'расход', 'экономика', 'продавец', 'посылка', 'перевод', 'звонок', 'перерыв', 'коллекция', 'доклад',
             'праздничный', 'замена', 'вентилятор', 'усложнение', 'разработка', 'перемена', 'написание', 'мировоззрение',
             'достижение', 'терминал', 'лицензия', 'команда', 'опытность', 'популярность', 'пример', 'участие',
             'производство', 'конференция', 'деление', 'экзамен', 'урок', 'новинка', 'новизна', 'путь', 'урожай',
             'холодильник', 'перевозка', 'настройка', 'оценка', 'причина', 'спектакль', 'сказка', 'теория',
             'определение', 'выставка', 'билет', 'автобус', 'энергия', 'переписка', 'закупка', 'переезд', 'заседание',
             'комментарий', 'баланс', 'процесс', 'профессия', 'воспитание', 'польза', 'интерес', 'рассказ', 'вещание',
             'архив', 'заголовок', 'загрузка', 'механизм', 'режим', 'модель', 'аккаунт', 'логин', 'взаимодействие',
             'социальный', 'обслуживание', 'обеспечение', 'платёж', 'регистрация', 'платформа', 'файл', 'поиск',
             'новость', 'адрес', 'раздел', 'документ', 'объект', 'точка', 'позиция', 'заявка', 'каталог', 'папка',
             'содержание', 'запись', 'загрузка', 'память', 'шаблон', 'шрифт', 'печать', 'буфер', 'команда', 'ссылка',
             'переход', 'вкладка', 'элемент', 'таблица', 'порядок', 'номер', 'профиль', 'редактор', 'база', 'архив',
             'событие', 'режим', 'устройство', 'настройка', 'фильтр', 'контакт', 'модуль', 'запрос', 'система', 'кнопка']

def get_word():
    word_list_len = len(word_list)
    random_num = random.randint(0, word_list_len)
    random_word = word_list[random_num]
    return random_word.upper()

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           -
        ''',
        # голова, торс, обе руки, одна нога
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / 
           -
        ''',
        # голова, торс, обе руки
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |      
           -
        ''',
        # голова, торс и одна рука
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |     
           -
        ''',
        # голова и торс
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |     
           -
        ''',
        # голова
        '''
           --------
           |      |
           |      O
           |    
           |      
           |     
           -
        ''',
        # начальное состояние
        '''
           --------
           |      |
           |      
           |    
           |      
           |     
           -
        '''
    ]
    return stages[tries]

def play(word):
    word_completion = '_' * len(word)
    guessed = False
    guessed_letters = []
    guessed_words = []
    tries = 6

    print('Давайте играть в угадайку слов!')
    print(display_hangman(tries))
    print(word_completion)

    while True:
        s = input('Введи букву или слово: ').strip()
        if len(s) == 0:
            print('Строка не должна быть пустой')
            print()
        elif not s.isalpha():
            print('Нужно ввести букву или слово')
            print()
        else:
            break
    print()

    is_word = False
    if len(s) != 1:
        is_word = True

    if is_word:
        if s in guessed_words:
            print('Ты уже назвал это слово')
    else:
        if s in guessed_letters:
            print('Ты уже называл эту букву')
        elif s not in word:
            print('Такой буквы нет')
            guessed_letters.append(s)
            tries -= 1
        else:
            guessed_letters.append(s)



