import random

print('Guess the words')
print()

word_list = ['абажур', 'азарт', 'багет', 'баклажан', 'балкон', 'банан', 'барьер', 'бегемот',
             'бедро', 'бензин', 'берёза', 'бинокль', 'блин', 'бобёр', 'борщ', 'браслет', 'бровь', 'булка', 'бутон',
             'вагон', 'валенки', 'вата', 'ведро', 'веник', 'веранда', 'весна', 'ветер', 'вилка', 'виноград', 'вокзал', 'воротник', 'воск', 'высота', 'гвоздь', 'гитара', 'глаз', 'глобус', 'гнездо', 'гном', 'гора', 'город', 'горох', 'грабли', 'градусник', 'гроза', 'грибы', 'губы', 'гусь', 'давка', 'дождь', 'домино', 'дуб', 'енот', 'ёлка', 'жаворонок', 'жаба', 'жёлудь', 'жеребец', 'жилет', 'жираф', 'забор', 'замок', 'занавес', 'зебра', 'земляника', 'змея', 'игрушка', 'изюм', 'икра', 'индюк', 'кабан', 'каблук', 'кадр', 'какао', 'кальмар', 'капуста', 'карась', 'карман', 'картошка', 'каска', 'катер', 'каштан', 'кирпич', 'кисть', 'класс', 'клён', 'ковёр', 'кокос', 'колено', 'колодец', 'компот', 'корова', 'костюм', 'корабль', 'котлета', 'кость', 'краб', 'кран', 'крыша', 'кубик', 'кукуруза', 'кукла', 'кулон', 'курица', 'куст', 'лавка', 'лампа', 'лапша', 'ласка', 'лев', 'лейка', 'лес', 'лестница', 'лист', 'лиса', 'лодка', 'ложка', 'лопата', 'лосось', 'луна', 'лягушка', 'малина', 'мальчик', 'манго', 'мантия', 'масло', 'маска', 'медведь', 'мешок', 'миндаль', 'мишка', 'молоток', 'молоко', 'мост', 'мяч', 'мыло', 'мышь', 'нора', 'нос', 'носки', 'ноутбук', 'обед', 'облако', 'овощи', 'огонь', 'одежда', 'оленёнок', 'олень', 'омлет', 'опушка', 'орех', 'оса', 'остров', 'охота', 'очки', 'папка', 'пара', 'парта', 'паспорт', 'паста', 'пельмени', 'пенал', 'пенка', 'пень', 'перец', 'песок', 'пижама', 'пила', 'пилот', 'пингвин', 'пирог', 'писатель', 'письмо', 'плавник', 'платье', 'плита', 'плод', 'пломбир', 'пояс', 'подсолнух', 'подушка', 'позвонок', 'поезд', 'покемон', 'полка', 'помидор', 'попугай', 'поросёнок', 'портфель', 'порт', 'поцелуй', 'почка', 'праздник', 'предмет', 'прическа', 'птичка', 'пуля', 'пчела', 'пшеница', 'пятка', 'раковина', 'ракета', 'рама', 'ранец', 'растение', 'рак', 'редис', 'река', 'ремень', 'рис', 'робот', 'роза', 'роса', 'рот', 'рубашка', 'ручка', 'рыба', 'рыцарь', 'рюкзак', 'рябина', 'сало', 'салют', 'сани', 'сапог', 'сарай', 'сачок', 'свёкла', 'свинья', 'свеча', 'сердце', 'сетка', 'сито', 'скворец', 'скейт', 'скворечник', 'сковорода', 'скрипка', 'слон', 'сметана', 'снег', 'собака', 'сок', 'соловей', 'соль', 'сосна', 'сосуд', 'софа', 'спальня', 'спичка', 'стакан', 'стена', 'стол', 'стул', 'сумка', 'сыр', 'тарелка', 'тетрадь', 'тигр', 'туалет', 'тушь', 'туча', 'удочка', 'утка', 'ухват', 'фартук', 'ферма', 'фиалка', 'флаг', 'фонарь', 'форма', 'фотоаппарат', 'фрукты', 'фуксия', 'хлеб', 'хлопья', 'хомяк', 'хвост', 'цапля', 'цветок', 'цыплёнок', 'чайник', 'часы', 'черепаха', 'черника', 'чеснок', 'шоколад', 'шкаф', 'щётка', 'эклер', 'экран', 'электрик', 'эльф', 'энергия', 'эхо', 'юла', 'юноша', 'юрта', 'яблоко', 'ягода', 'ягуар', 'яичница', 'якорь', 'яма', 'язык']

def get_word():
    word_list_len = len(word_list)
    random_num = random.randint(0, word_list_len)
    random_word = word_list[random_num]
    return random_word.upper()

def display_hangman(tries):
    stages = [  # финальное состояние: голова, торс, обе руки, обе ноги
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           -
        ''',
        # голова, торс, обе руки, одна нога
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / 
           -
        ''',
        # голова, торс, обе руки
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |      
           -
        ''',
        # голова, торс и одна рука
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |     
           -
        ''',
        # голова и торс
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |     
           -
        ''',
        # голова
        '''
           --------
           |      |
           |      O
           |    
           |      
           |     
           -
        ''',
        # начальное состояние
        '''
           --------
           |      |
           |      
           |    
           |      
           |     
           -
        '''
    ]
    return stages[tries]

def play(word):
    word_completion = '_' * len(word)
    guessed = False
    guessed_letters = []
    guessed_words = []
    tries = 6

    print('Давайте играть в угадайку слов!')
    print(display_hangman(tries))
    print(word_completion)

    while True:
        s = input('Введи букву или слово: ').strip()
        if len(s) == 0:
            print('Строка не должна быть пустой')
            print()
        elif not s.isalpha():
            print('Нужно ввести букву или слово')
            print()
        else:
            break
    print()

    is_word = False
    if len(s) != 1:
        is_word = True

    if is_word:
        if s in guessed_words:
            print('Ты уже назвал это слово')
    else:
        if s in guessed_letters:
            print('Ты уже называл эту букву')
        elif s not in word:
            print('Такой буквы нет')
            guessed_letters.append(s)
            tries -= 1
        else:
            guessed_letters.append(s)



