# Профессор Тимур преподает вводный курс статистики и попросил вас написать программу,
# которую он мог бы использовать на занятиях для имитации бросания игральных кубиков.
# Программа должна случайным образом генерировать два числа в диапазоне от  1 до 6 и показывать их.

import random

a = random.randint(1, 6)
b = random.randint(1, 6)

print(a)
print(b)