# Напишите программу, которая принимает строку текста - имя человека,
# - и выводит на экран приветствие в следующем формате: Привет, <имя человека>,
# где <имя человека> – строка текста, которую ваша программа приняла на вход.

name = input('Введи своё имя: ')
print(f'Привет, {name}')