import random

print('Магический шар 8')
print()

def choice(lst):
    random_num = random.randint(0, len(lst) - 1)
    return lst[random_num]


answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять',
           'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')

s = ''
while True:
    s = input('Как тебя зовут? ')
    if len(s.strip()) == 0:
        print('Имя не может быть пустым')
        print()
    else:
        break
print()

print(f'Привет {s}')

retry = 'y'
while retry == 'y':
    print('Задай свой вопрос:')
    request = input()
    print(choice(answers))
    print('-' * 30)
    retry = input('Хочешь ещё что-то узнать? y (да) или n (нет) ')
    while retry != 'y' and retry != 'n':
        print('Я тебя не понял. Повтори, пожалуйста')
        print('-' * 30)
        retry = input('Хочешь ещё что-то узнать? y (да) или n (нет) ')
    print('*' * 30)

print('Возвращайся, если возникнут вопросы!')