import random

print('Угадайка слов')
print()

word_list = ['город', 'машина', 'столик', 'книга', 'собака', 'туман', 'ручка', 'яблоко', 'береза', 'комната', 'река',
             'лодка', 'погода', 'ученик', 'письмо', 'школа', 'доска', 'окно', 'молоко', 'груша', 'тетрадь', 'семья',
             'солнце', 'цветок', 'картина', 'облако', 'дерево', 'игрушка', 'карман', 'телефон', 'пальто', 'площадь',
             'программа', 'компьютер', 'библиотека', 'работа', 'собрание', 'друзья', 'квартира', 'праздник', 'ночь',
             'утро', 'вечер', 'день', 'новость', 'концерт', 'песня', 'интернет', 'комплекс', 'работник', 'семинар',
             'планета', 'блог', 'портфель', 'образование', 'система', 'поездка', 'пейзаж', 'вкусный', 'жизнь',
             'практика', 'попытка', 'животное', 'глобус', 'проект', 'анализ', 'монитор', 'анекдот', 'технология',
             'кандидат', 'поток', 'вариант', 'реформы', 'изучение', 'вопрос', 'предмет', 'сотрудник', 'студент',
             'платформа', 'посещение', 'отдых', 'инструмент', 'сервис', 'ресторан', 'разговор', 'вечеринка', 'награда',
             'календарь', 'чемпион', 'подруга', 'статья', 'домашний', 'уровень', 'гаджет', 'выбор', 'успех', 'победа',
             'информация', 'кафе', 'страна', 'отель', 'сделка', 'планы', 'сайт', 'молодежь', 'время', 'подарок',
             'страшный', 'задание', 'снег', 'лето', 'человек', 'кино', 'карьер', 'менеджер', 'замечание',
             'обучение', 'секрет', 'познание', 'путевка', 'небо', 'услуга', 'поставщик', 'создание', 'клиент',
             'договор', 'поддержка', 'сеть', 'платеж', 'начало', 'директор', 'принцип', 'параметр', 'отзыв', 'тренировка',
             'интерфейс', 'компиляция', 'дисплей', 'гарантия', 'пароль', 'покрытие', 'обновление', 'активность',
             'контроль', 'персонаж', 'самостоятельность', 'обзор', 'учебник', 'партнер', 'идея', 'обсуждение',
             'недвижимость', 'функция', 'знание', 'безопасность', 'страх', 'файл', 'индекс', 'образ', 'проверка',
             'администрация', 'офис', 'действие', 'вход', 'психология', 'таблица', 'этап', 'партия', 'воздух', 'прибор',
             'событие', 'контракт', 'деятельность', 'доступ', 'правило', 'версия', 'объяснение', 'метод', 'передача',
             'переговоры', 'переработка', 'операция', 'цель', 'первичный', 'вещь', 'мероприятие', 'отчёт', 'интерактив',
             'кнопка', 'запуск', 'решение', 'основа', 'сообщение', 'прогноз', 'моторика', 'протокол', 'зрелище',
             'расход', 'экономика', 'продавец', 'посылка', 'перевод', 'звонок', 'перерыв', 'коллекция', 'доклад',
             'праздничный', 'замена', 'вентилятор', 'усложнение', 'разработка', 'перемена', 'написание', 'мировоззрение',
             'достижение', 'терминал', 'лицензия', 'команда', 'опытность', 'популярность', 'пример', 'участие',
             'производство', 'конференция', 'деление', 'экзамен', 'урок', 'новинка', 'новизна', 'путь', 'урожай',
             'холодильник', 'перевозка', 'настройка', 'оценка', 'причина', 'спектакль', 'сказка', 'теория',
             'определение', 'выставка', 'билет', 'автобус', 'энергия', 'переписка', 'закупка', 'переезд', 'заседание',
             'комментарий', 'баланс', 'процесс', 'профессия', 'воспитание', 'польза', 'интерес', 'рассказ', 'вещание',
             'архив', 'заголовок', 'загрузка', 'механизм', 'режим', 'модель', 'аккаунт', 'логин', 'взаимодействие',
             'социальный', 'обслуживание', 'обеспечение', 'платёж', 'регистрация', 'платформа', 'файл', 'поиск',
             'новость', 'адрес', 'раздел', 'документ', 'объект', 'точка', 'позиция', 'заявка', 'каталог', 'папка',
             'содержание', 'запись', 'загрузка', 'память', 'шаблон', 'шрифт', 'печать', 'буфер', 'команда', 'ссылка',
             'переход', 'вкладка', 'элемент', 'таблица', 'порядок', 'номер', 'профиль', 'редактор', 'база', 'архив',
             'событие', 'режим', 'устройство', 'настройка', 'фильтр', 'контакт', 'модуль', 'запрос', 'система', 'кнопка']

# Берём случайное слово из word_list
def get_word():
    word_list_len = len(word_list)
    random_num = random.randint(0, word_list_len - 1)
    random_word = word_list[random_num]
    return random_word.upper()

# Рисуем виселицу
def display_hangman(tries):
    stages = [
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           |   ==   ==
           -
        ''',
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           |   ==   
           -
        ''',
        # финальное состояние: голова, торс, обе руки, обе ноги
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     / \\
           |
           -
        ''',
        # голова, торс, обе руки, одна нога
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |     /
           | 
           -
        ''',
        # голова, торс, обе руки
        '''
           --------
           |      |
           |      O
           |     \\|/
           |      |
           |
           |      
           -
        ''',
        # голова, торс и одна рука
        '''
           --------
           |      |
           |      O
           |     \\|
           |      |
           |
           |     
           -
        ''',
        # голова и торс
        '''
           --------
           |      |
           |      O
           |      |
           |      |
           |
           |     
           -
        ''',
        # голова
        '''
           --------
           |      |
           |      O
           |
           |    
           |      
           |     
           -
        ''',
        # начальное состояние
        '''
           --------
           |      |
           |      
           |    
           |      
           |
           |     
           -
        '''
    ]
    return stages[tries]

# Основные действия
def play(word):
    word_completion = '_' * len(word)   # строка, содержащая символы _ на каждую букву задуманного слова
    guessed = False                     # сигнальная метка
    guessed_letters = []                # список уже названных букв
    guessed_words = []                  # список уже названных слов
    tries = 8                           # количество попыток

    print('Давайте играть в угадайку слов!')
    print(display_hangman(tries))
    print(word_completion)

    # пока не будет нарисована вся виселица или пользователь не отгадает слово
    while tries > 0 and not guessed:
        while True:
            s = input('Введите букву или слово: ').strip().upper()
            if len(s) == 0:
                print('Строка не должна быть пустой')
                print()
            elif not s.isalpha():
                print('Нужно ввести букву или слово')
                print()
            else:
                break
        print()

        is_word = False
        if len(s) != 1:
            is_word = True

        if is_word: # Если пользователь ввёл слово
            if s in guessed_words:  # Если пользователь уже вводил такое слово раньше
                print('Вы уже называли это слово')
            elif s != word: # Если пользователь ввёл неправильное слово
                print('Вы назвали неправильное слово')
                guessed_words.append(s)
                tries -= 1
            else:   # Если пользователь ввёл правильное слово
                word_completion = word
                guessed = True
        else:   # Если пользователь ввёл букву
            if s in guessed_letters:    # Если пользователь вводил уже такую букву раньше
                print('Вы уже называли эту букву')
            elif s not in word: # Если такой буквы в слове нет
                print('Такой буквы в слове нет')
                guessed_letters.append(s)   # Запоминаем букву как уже введённую
                tries -= 1
            else:   # Если такая буква есть в слове
                guessed_letters.append(s)   # Запоминаем букву как уже введённую
                new_completion = ''

                # Заменяем _ на правильно введённые буквы
                for i in range(len(word)):
                    if word[i] in guessed_letters:
                        new_completion += word[i]
                    else:
                        new_completion += '_'
                word_completion = new_completion

                if '_' not in word_completion:  # Если пользователь угадал слово
                    guessed = True

        # Если пользователь угадал слово, виселицу показывать не нужно.
        # Если виселица нарисована полностью, слово показывать не нужно.
        # Если слово не угадано и виселица не нарисована, показывать и виселицу, и неполное слово.
        if not guessed:
            print(display_hangman(tries))
        if tries != 0:
            print(word_completion)
        print()

    if guessed:
        print('Поздравляем, вы угадали слово! Вы победили!')
    else:
        print(f'Вы проиграли. Загаданное слово: {word}')
    print()

while True:
    play(get_word())
    again = input('Хотите сыграть в "Угадайку слов" ещё раз? y(да) или n(нет)? ')
    print()
    if again != 'y':
        print('Пока! Ещё увидимся!')
        break
